stressTests/10.yml
config:
  target: 'https://test.api.nodalblock.com'
  payload:
    path: "./contract.csv"
    fields:
      - "contract_id"
    order: "sequence"
  phases:
    - duration: 100
      arrivalRate: 0
      rampTo: 50
      name: "Stress test incrementing load"
  processor: "./functions.js"
scenarios:
  - flow: 
    - get:
        url: "/v2/es/contracts/{{ contract_id }}"
        beforeRequest: "setHeadersParameters"
        afterResponse: "logHeaders"
    - get:
        url: "/v2/es/contracts/{{ contract_id }}/certificate"
        beforeRequest: "setHeadersParameters"
        afterResponse: "logHeaders"
    - get:
        url: "/v2/es/contracts/{{ contract_id }}/infocertificate"
        beforeRequest: "setHeadersParameters"
        afterResponse: "logHeaders"